{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-3-100",
            "title": "SceneTix: A Community Oriented Ticket Selling Platform",
            "studentName": "Anna Mirkarimova",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Laurie Anderson",
            "posterLink": "./posters/csse/mirkarimova-anna.png",
            "abstract": "The ticket buying process has been known to be an unpleasant and often unfair experience. Many major ticket platforms don’t allow for fair ticket resales or transfers leading users to turn to third party platforms such as Facebook to resell their concert tickets. Ticket selling platforms also commonly lack any kind of messaging system for communication between attendees/event holders. This can create the opportunity for scams and leads to an overall lack of community. To address these issues, SceneTix was developed.\n\n SceneTix is a web application catered towards smaller local events and includes a ticket reselling system that aims to eliminates ticket resale scams, public user profiles and a messaging system between users, as well as a message board for each posted event that allows attendees to communicate with each other. SceneTix was developed using full stack development tools such as Node.js, MongoDB, Bootstrap, GitHub, and Heroku.\n\n This project was a great opportunity to not only gain knowledge in web development, but to also work on a project and tackle a business problem that is both interesting to me and innovative. If further developed and released, SceneTix could make the ticket buying experience more user friendly and solve many of the issues associated with the current ticket buying process."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-3-115",
            "title": "Personalization @ Amazon Retail",
            "studentName": "Braxton Goss",
            "studentMajor": "CSSE",
            "projectType": "Internship - Amazon",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/goss-braxton.png",
            "abstract": "During my internship at CoreRecs, I worked on a new tool using Typescript with React that was designed to enhance Amazon's user experience by streamlining the recommendation creation process for marketers and engineers. The objective of the tool was to simplify the creation of brand new marketing and remove the technical barriers faced by beginner marketers while also reducing the engineering hours needed to fix issues. I was able to leverage AWS technologies like S3 and Lambda to accomplish this.\n\n Before the development of this tool, creating personalized recommendations was a cumbersome process for marketers. It involved dealing with overly complex terminologies and JSON files, which resulted in many hours of engineer work to fix issues. This often led to a higher barrier-to-entry for beginner marketers, who struggled to keep up with the technical aspects of the process. This is where our tool came in, as it significantly reduced the complexity of the process and empowered marketers to create exciting and innovative recommendations.\n\n The software development lifecycle used during the development of the tool was Kanban, which allowed for continuous improvement and iteration. After its development, the tool was published to an internal service hosted by CoreRecs, allowing marketers and engineers to access it easily. This new tool helped over 600+ marketers understand all the various marketing tools available to them, resulting in a lower barrier-to-entry and increased efficiency in the creation process. The tool also enabled engineers to focus on more critical technical issues while allowing marketers to create powerful recommendations that enhanced Amazon's user experience.\n\n In conclusion, my internship project resulted in the development of a tool that simplified the recommendation creation process and lowered the technical barriers for beginner marketers, resulting in exciting and powerful recommendations. By reducing the time commitment for engineers to fix issues, the tool improved efficiency and allowed for a smoother creation process. Overall, the tool's significance lies in its ability to empower marketers of all levels and enhance the user experience of Amazon's various platforms using cutting-edge technologies and a streamlined development process."
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-3-130",
            "title": "Kill or Wipe - World of Warcraft: Classic Boss Fight Predictor",
            "studentName": "James Pfleger",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/pfleger-james-charles-losi.png",
            "abstract": "World of Warcraft: Classic is an online multiplayer role playing game where you complete quests and defeat monsters to collect equipment and weapons to strengthen your character. Each week players are able to band together to defeat extremely powerful enemies in raids that drop powerful gear.\n\n These raids can last up to many hours and span over multiple days in order for the team to defeat every boss in them. Then each week, the raid is reset and the team defeats them again hoping for the gear they want to drop. Players also upload their combat data to warcraftlogs.com so that they can analyze and compare their performance.\n\n I wanted to use this information that players upload in a way to improve my raid team’s performance and experience playing the game. I created a RNN machine learning model for each boss fight. My application predicts the probability of successfully defeating a boss while you are fighting it based on the damage done, healing done, and damage taken through the fight currently. This application is able to cut down on wasted time fighting a losing battle.\n\n With continued development, this application will significantly cut down on wasted time in raid, and will speed up the entire process of setting up for the fight. With more time spend on fights with higher chance of success, the raid teams will defeat more bosses, and thus get more powerful gear and weapons."
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-3-145",
            "title": "First PRG in the Godot Engine",
            "studentName": "Rachel Kim",
            "studentMajor": "CSSE",
            "projectType": "Individual Project - Student Defined",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/kim-rachel.png",
            "abstract": "For this capstone personal project, I chose to create my first game in the Godot engine. The reason I choose the Godot engine is because of it’s intuitive design from the tools it provides and the robust scripting language, GDScript. I chose to use the 2d feature of the engine instead of the 3d feature, as it comes with less complexity, and I didn’t want to overwhelm myself for my first game.\n\n The purpose of the project was to gain experience and start my game development journey. Games are a passion of mine that I’ve had my whole life, and with my ability to code, I wanted to apply it to creating games. I hope to work for game companies in the future, and I’d also like to develop my own games.\n\n By creating a full game for this capstone project, I was able to learn the basics of creating a 2d game, and the tools and building blocks that are used to create a game. My short game features the ability to attack enemies and deal damage. Once the player enters the enemy’s range, the enemies are able to chase down and attack the player and deal damage. I was able to set up collisions so that the player would not be able to cross walls, bushes, and trees. I also had to do a lot of adjustments on the physics of the game. For example, I had to make adjustments to the speed the player would walk, and how friction would work against the player when there was no directional input, so that movement did not feel rigid but smoother. That was one of the many adjustments I made!\n\n Overall, I am proud of my work, and more importantly have come away from this project with a lot of knowledge I learned over the many weeks I worked on this. Before, I did not know a thing about game development, much less about the Godot engine. But now I can make a fully functional game and understand the most commonly used features of Godot. I feel confident in continuing my game development future, and will hopefully be creating some more cool games in my future years!"
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-3-200",
            "title": "App Extensions and API's from Online Store to Shopify",
            "studentName": "David Galenko",
            "studentMajor": "CSSE",
            "projectType": "Internship - Teamatical Inc.",
            "facultyAdvisor": "Dr. Robert Dimpsey",
            "posterLink": "./posters/csse/galenko-david.jpg",
            "abstract": "For the past 2 and a half months I have been working on a project for a small company called Teamatical to create an extension on Shopify that extends features developed on the Teamatical website to Shopify websites. This was done in the form of a NodeJS application with a working front and backend which connects to Shopify services via Shopify tools. With these tools including Shopify’s API, I was able to create a working version of the application.\n\n The need of this extension onto Shopify websites and what kind of features we provide for Shopify owners would allow a new niche service onto these websites. The kind of features that I implemented was the ability for customers to add a name and number to sportswear such as jersey’s that we provide as a company. The ability to easily add these products onto their Shopify sites with full integration with our website. With that integration I was able to dynamically change the image of the product to match any input put in by the customer. Along with any products bought on Shopify to be sent out to production automatically removing any complications with sending out orders externally.\n\n The significance of creating such an app is a potentially large expansion and production rate of our products. Although I don’t have any percentages of what this rate might be, we already have a large clientele needing an application like this on their website to give them the ability to add a significant amount of products that customers can personally customize which doesn’t come around often.\n\n In conclusion, this was a very fun and exciting project for me because I always had an interest in website and full-stack development. It was an enlightening experience because I had full control of what got done when, with set requirements for the extension that were given by the CEO. Because there was no schedule or deadlines, this allowed me to completely finish sections then present them to the company. I can go on for pages with the specifics of what I did and how it was done. I finished the required 400 hour minimum needed, and I strongly believe I have done more than enough for the completion of this Capstone. Luckily, I now have a full-time position for the continuation of this app thanks to the need of a Capstone for my degree."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-3-215",
            "title": "Application Security Management at Costco",
            "studentName": "Phillip Burlachenko",
            "studentMajor": "CSSE",
            "projectType": "Internship - Costco",
            "facultyAdvisor": "Dr. Marc Dupius",
            "posterLink": "./posters/csse/burlachenko-phillip.png",
            "abstract": "My capstone project was sponsored by Costco Wholesale, where I was an intern on the Application Security team. The objective of the internship was to learn about the cybersecurity industry and to become familiar with working in Costco’s Information Security environment.\n\n The Application Security team focuses on improving the security of Costco’s applications (both in-house developed and vendor provided). The team responsibilities include performing vulnerability scans & assessments, integrating security assurance into the CI/CD pipeline, and supporting developers with resources, tools, education, policy, and guidance to remediate vulnerabilities.\n\n A great amount of my time was spent on researching the various tools, policies, and procedures the AppSec team utilizes. This includes the different teams and operations involved in InfoSec. The AppSec team assigned me to oversee, improve, and manage the dynamic application security testing (DAST) services, as well as the Costco HackerOne program.\n\n During my internship I was able to perform configuration, troubleshooting, monitoring, and auditing of information system activities utilizing multiple application security related tools. This also includes managing vulnerability scans and outputs, reporting new findings, and providing consultative services to teams and stakeholders to improve application security within their environments. I also got to work with vendors for product consideration, recommendation, and training. I improved AppSec’s operational work by automating some of the tasks that were previously done manually.\n\n The most significant part of my internship was the valuable experiences I had working with the AppSec team. I learned an in-depth understanding of application specific testing methodologies and vulnerabilities, and how to work with vendors and stakeholders to secure their assets. I also got to experience how cybersecurity solutions are applied and executed within a large corporate environment."
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-3-230",
            "title": "WellnessIQ: Health Monitoring Application",
            "studentName": "Sarah Asad",
            "studentMajor": "CSSE",
            "projectType": "Internship - Gekko Corporation",
            "facultyAdvisor": "Dr. Marc Dupius",
            "posterLink": "./posters/csse/asad-sarah.png",
            "abstract": "On average, individuals in the United States tend to seek medical attention 2-4 times per year. During these visits, healthcare professional typically records basic vital signs such as heart rate, blood pressure, and temperature. However, such data alone may not provide a complete understanding of an individual’s overall health status. Furthermore, in the wake of the COVID- 19 pandemic, virtual appointments have become increasingly common, presenting challenges for healthcare providers in obtaining accurate vital sign measurements.\n\n To address these challenges, At Gekko Corporation, we have developed a cross-platform application that leverages wearable technology and IoT devices to collect comprehensive health data. Our solution supports a diverse range of devices, including Apple Watches, Fitbits, Dexcom’s, Oura rings, and numerous others that we plan to incorporate in the future. The integration of data from these devices enables healthcare professionals to obtain a more holistic view of a patient’s overall health status, beyond just the basic vitals taken during routine medical check-ups.\n\n WellnessIQ is a mobile application that is compatible with both Android and IOS platforms, designed to help healthcare providers monitor their patient’ health and wellbeing with the use of everyday devices. The app allows for easy account creation and Bluetooth device selection, enabling users to send health data from their preferred device with minimal hassle. Using the HealthKit API within react native, the app can extract a variety of health data including heart rate, heart rate variability, oxygen saturation, respiratory rate, body temperature, and sleep analysis, and more we hope to add in the future.\n\n At the end of each day, health data is automatically pulled from the user’s device and sent via an HTTP POST request to the Splunk Enterprise Database. Once the data is in Splunk, machine learning algorithms analyze and categorize the data, identifying outliers and creating informative visualizations such as graphs and charts. Healthcare providers can use these visualizations to monitor their patients’ health trends, identify potential risks, and provide personalized recommendations for improving their patients’ health.\n\n We are currently in the beta testing phase and are focusing on developing a roust backend system to securely store user credentials, integrate a wide range of new devices, and onboard additional beta testers. Furthermore, were aiming to create a web-bases version of WellnessIO, providing users with convenient access to their health dashboards.\n\n Overall, our platform empowers healthcare providers and individuals to efficiently monitor and manage their health using everyday devices."
        }
    ]
}
